In [ ]:
# pip install sqlalchemy_schemadisplay

In [92]:
import pandas
import pyodbc
import sqlalchemy
from sqlalchemy import *
from pygraphviz import *
import urllib
import os

server = '10.43.20.148'
database = 'HimsLoan'
username = os.environ.get('HIMS_USERNAME')
password = os.environ.get('HIMS_PASSWORD')
driver='{ODBC Driver 17 for SQL Server}'

params = urllib.parse.quote_plus('DRIVER='+driver+';SERVER='+server+';PORT=1443;DATABASE='+database+';UID='+username+';PWD='+password)
engine = sqlalchemy.create_engine('mssql+pyodbc:///?odbc_connect=%s' % params)

In [93]:
engine

Engine(mssql+pyodbc:///?odbc_connect=DRIVER={ODBC Driver 17 for SQL Server};SERVER=10.43.20.148;PORT=1443;DATABASE=HimsLoan;UID=HunterOwensITA;PWD=jE93$_erm3947)

In [94]:
#import pandas as pd
#print(engine.table_names())
#inspector = inspect(engine)
# Get table information
#print(inspector.get_table_names())

In [95]:
# Get column information
#print(inspector.get_columns('ActivityLog'))

In [96]:
'''conn = engine.connect()
meta = MetaData(engine).reflect()
table = meta.tables['ActivityLog']
select_st = select([table]).where(
   table.c.l_name != 'Hello')
res = conn.execute(select_st)
for _row in res:
    print(_row)'''

"conn = engine.connect()\nmeta = MetaData(engine).reflect()\ntable = meta.tables['ActivityLog']\nselect_st = select([table]).where(\n   table.c.l_name != 'Hello')\nres = conn.execute(select_st)\nfor _row in res:\n    print(_row)"

In [97]:
table_list = ['A', 'ActivityLog', 'AssnProjectIDISNo', 'AssnProjectAPNCBTS', 'AssnProjectIDIS','AssnProjectUseProjectArea', 
              'DataCleanUp', 'DataCleanUpRawAPNs', 'DataCleanUpRawIDISs', 'EllisApns', 
              'FundingInfo', 'FundingInfoHistory', 
              'IDISActivity', 'IDISHomeCount', 'IDISHomeStatus',
              'landuseAPN_1', 'LandUsed', 
              'Loan', 'MilestoneDate', 'NSPFundUse',
              'ParticipantHistory', 'PercentGrossRentUnits', 'ProgramMilestones', 'Project', 'ProjectCouncilFile', 
              'ProjectStatusChangeHistory', 'ProjectUnits', 'Property', 
             ]

lut_tables = ['LutActivitySubType', 'LutActivityType', 'LutCDBGNationalObjective', 'LutCertifiedNeiborhoodCouncil', 'LutCityofLA',
              'LutCommunityPlanArea', 'LutCouncilDistrict', 'LutFundingInfoSubsidyType', 'LutFundingLanguage', 'LutHouseholdRace', 'LutHouseholdSize', 
              'LutHouseholdType', 'LutHouseType', 'LutIDISActivityStatus', 'LutIDISNoType', 'LutIncomeCode', 'LutIncomeType', 
              'LutMilestoneName', 'LutMilestoneSection', 'LutNationalObjective', 'LutNSPActivityType', 'LutNSPProgram', 'LutpercentHouseholdMed', 
              'LutSubsidy', 'LutSubsidyProgramType', 'LutSubsidyYear', 'LutTargetPopulation', 
             ]

In [98]:
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
import pandas as pd
from eralchemy import render_er

In [99]:
from sqlalchemy import (MetaData, Table, Column)    
metadata = MetaData()

In [100]:
# Posible model template to follow
'''# create model ....
users = Table('users', metadata,
    Column('user_id', Integer(), primary_key=True),
    Column('username', String(15), nullable=False, unique=True),
)    
orders = Table('orders', metadata,
    Column('order_id', Integer()),
    Column('user_id', ForeignKey('users.user_id')),
)'''

"# create model ....\nusers = Table('users', metadata,\n    Column('user_id', Integer(), primary_key=True),\n    Column('username', String(15), nullable=False, unique=True),\n)    \norders = Table('orders', metadata,\n    Column('order_id', Integer()),\n    Column('user_id', ForeignKey('users.user_id')),\n)"

In [101]:
#test_table = Table('ProjectCouncilFile', metadata, autoload=True, autoload_with=engine)

In [102]:
# long list of table attributes without separation 
'''from sqlalchemy.engine import reflection
insp = reflection.Inspector.from_engine(engine)
for tbl in table_list: 
    [print(c['name'], c['type']) for c in insp.get_columns(tbl)]'''

"from sqlalchemy.engine import reflection\ninsp = reflection.Inspector.from_engine(engine)\nfor tbl in table_list: \n    [print(c['name'], c['type']) for c in insp.get_columns(tbl)]"

In [146]:
# List all the tables in table_list with separation (**need to add table headers**)
import pandas as pd
from sqlalchemy.engine import reflection
from sqlalchemy.inspection import inspect
from eralchemy import render_er
insp = reflection.Inspector.from_engine(engine)
for tbl in table_list:
    tbl_erd = [(c['name'], c['type']) for c in insp.get_columns(tbl)]
    fk_erd = [(c['name']) for c in insp.get_foreign_keys(tbl)]
    pk_erd = [(c['name'], for c in query.filter(User.name.ilike('%pk%'))
    #pk_erd = [(c['name']) for c in insp.get_pk_constraint(tbl, schema=None)]
    erd_df = pd.DataFrame(tbl_erd)    
    display(erd_df, fk_erd, pk)

                  0                                                  1
0             LogID                                            INTEGER
1      ProjUniqueID                                            INTEGER
2            LoanID                                            INTEGER
3      BankruptcyID                                            INTEGER
4    ForeclosuresID                                            INTEGER
5      AssumptionID                                            INTEGER
6       AmendmentID                                            INTEGER
7         ProbateID                                            INTEGER
8   SubordinationID                                            INTEGER
9        CategoryID                                            INTEGER
10          LogDate                                           DATETIME
11          LogUser  VARCHAR(20) COLLATE "SQL_Latin1_General_CP1_CI...
12       LogMessage     VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
13          IsAlert                                                BIT
14        IsDeleted                                                BIT
15       ModifiedOn                                           DATETIME
16       ModifiedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
17         Timestmp                                          TIMESTAMP

[]

                  0                                                  1
0             LogID                                            INTEGER
1      ProjUniqueID                                            INTEGER
2            LoanID                                            INTEGER
3      BankruptcyID                                            INTEGER
4    ForeclosuresID                                            INTEGER
5      AssumptionID                                            INTEGER
6       AmendmentID                                            INTEGER
7         ProbateID                                            INTEGER
8   SubordinationID                                            INTEGER
9        CategoryID                                            INTEGER
10          LogDate                                           DATETIME
11          LogUser  VARCHAR(20) COLLATE "SQL_Latin1_General_CP1_CI...
12       LogMessage     VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
13          IsAlert                                                BIT
14        IsDeleted                                                BIT
15       ModifiedOn                                           DATETIME
16       ModifiedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
17         Timestmp                                          TIMESTAMP
18            REOID                                            INTEGER
19    SubCategoryID                                            INTEGER
20  ReportingPeriod                                           DATETIME
21  CashRequestDate                                           DATETIME
22       CovenantID                                            INTEGER
23    Applicationid                                            INTEGER
24        InvoiceID                                            INTEGER

['FK_ActivityLog_AmendmentID',
 'FK_ActivityLog_Application',
 'FK_ActivityLog_AssumptionID',
 'FK_ActivityLog_Bankruptcy',
 'FK_ActivityLog_Foreclosures',
 'FK_ActivityLog_Loan',
 'FK_ActivityLog_LutActivitySubType',
 'FK_ActivityLog_LutActivityType',
 'FK_ActivityLog_Probate',
 'FK_ActivityLog_Project',
 'FK_ActivityLog_REO',
 'FK_ActivityLog_SubordinationID',
 'fkActivityLog_OMCovenant']

,0,1
0,AssnProjectIDISNoID,INTEGER
1,Projuniqueid,INTEGER
2,LutIDISNoTypeID,INTEGER
3,LutIDISActivityStatusCD,INTEGER
4,LutCDBGNationalObjectiveCD,INTEGER
5,IDISNo,"VARCHAR(20) COLLATE ""SQL_Latin1_General_CP1_CI..."
6,DateIDIScompletion,DATETIME
7,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
8,DateCreated,DATETIME
9,ModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
10,DateModified,DATETIME
11,Comment,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""

['fk_AssnProjectIDISNo_LutCDBGNationalObjective',
 'fk_AssnProjectIDISNo_LutIDISActivityStatus',
 'fk_AssnProjectIDISNo_LutIDISNoType',
 'fk_AssnProjectIDISNo_Project']

                  0                                               1
0  AssnProjectAPNID                                         INTEGER
1            ProjNo  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
2               APN  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"

[]

                   0                                               1
0  AssnProjectIDISID                                         INTEGER
1             ProjNo  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
2               IDIS  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"

[]

                  0                                                  1
0      ProjUniqueID                                            INTEGER
1  LutProjectAreaCD     CHAR(2) COLLATE "SQL_Latin1_General_CP1_CI_AS"
2       DateCreated                                           DATETIME
3         CreatedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
4      DateModified                                           DATETIME
5        ModifiedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...

['fk_AssnProjectUseProjectArea_LutProjectArea',
 'fk_AssnProjectUseProjectArea_Project']

              0                                                  1
0            ID                                            INTEGER
1          APNS  NVARCHAR(1000) COLLATE "SQL_Latin1_General_CP1...
2      NEW_APNS  NVARCHAR(1000) COLLATE "SQL_Latin1_General_CP1...
3      PROJ_NBR  NVARCHAR(1000) COLLATE "SQL_Latin1_General_CP1...
4  NEW_PROJ_NBR  NVARCHAR(1000) COLLATE "SQL_Latin1_General_CP1...
5      IDIS_NBR  NVARCHAR(100) COLLATE "SQL_Latin1_General_CP1_...
6  NEW_IDIS_NBR  NVARCHAR(100) COLLATE "SQL_Latin1_General_CP1_...

[]

        0                                               1
0      ID                                         INTEGER
1  ProjNo  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
2    APNs  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"

[]

        0                                               1
0      ID                                         INTEGER
1  ProjNo  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"
2   IDISs  VARCHAR COLLATE "SQL_Latin1_General_CP1_CI_AS"

[]

                    0                                                  1
0                 APN                                              FLOAT
1             NewApns                                              FLOAT
2             Address  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
3                 Zip                                              FLOAT
4                  CD  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
5           DateFiled                                           DATETIME
6    NumUnitsOccupied                                              FLOAT
7   NumWithdrawnUnits                                              FLOAT
8      UnitsWithdrawn                                              FLOAT
9           OwnerName  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
10       OwnerAddress  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
11           OwnerCSZ  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
12           NumBldgs  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
13          FutureUse  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
14                F14  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
15                F15  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...

[]

,0,1
0,FundingInfoID,INTEGER
1,ProjUniqueID,INTEGER
2,LutProjectActivityCD,INTEGER
3,LutProjectFundingTypeCD,INTEGER
4,LutProjectCategoryID,INTEGER
5,LutProjectSubCategoryID,INTEGER
6,LutFundingInfoSubsidyTypeCD,INTEGER
7,LutSourceofFundsCD,INTEGER
8,LutIncomeTypeID,INTEGER
9,FundRevSrcID,INTEGER
10,AppAccountCD,"VARCHAR(6) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
11,FundingAmt,MONEY
12,ProjectCategoryOther,"VARCHAR(250) COLLATE ""SQL_Latin1_General_CP1_C..."
13,SubsidyTypeOther,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
14,LutSubsidyTypeMMCCD,INTEGER
15,LutFirstMortgageTypeCD,INTEGER
16,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
17,DateCreatedBy,DATETIME
18,ModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
19,DateModified,DATETIME
20,Comments,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
21,AppAccountID,INTEGER

['FK_FundingInfo_FundingInfo',
 'FK_FundingInfo_LutFirstMortgageType',
 'FK_FundingInfo_LutIncomeType',
 'FK_FundingInfo_LutProjectActivity',
 'FK_FundingInfo_LutProjectCategory',
 'FK_FundingInfo_LutProjectFundingType',
 'FK_FundingInfo_LutProjectSubCategory',
 'FK_FundingInfo_LutSourceofFunds',
 'FK_FundingInfo_Project']

,0,1
0,HistoryId,INTEGER
1,FundingInfoID,INTEGER
2,ProjUniqueID,INTEGER
3,LutProjectActivityCD,INTEGER
4,LutProjectFundingTypeCD,INTEGER
5,LutProjectCategoryID,INTEGER
6,LutProjectSubCategoryID,INTEGER
7,LutFundingInfoSubsidyTypeCD,INTEGER
8,LutSourceofFundsCD,INTEGER
9,LutIncomeTypeID,INTEGER
10,FundRevSrcID,INTEGER
11,AppAccountCD,"VARCHAR(6) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
12,FundingAmt,MONEY
13,ProjectCategoryOther,"VARCHAR(250) COLLATE ""SQL_Latin1_General_CP1_C..."
14,SubsidyTypeOther,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
15,LutSubsidyTypeMMCCD,INTEGER
16,LutFirstMortgageTypeCD,INTEGER
17,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
18,DateCreatedBy,DATETIME
19,ModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
20,DateModified,DATETIME
21,Operation,"VARCHAR(10) COLLATE ""SQL_Latin1_General_CP1_CI..."
22,OperationModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
23,DateOperationModified,DATETIME
24,Comments,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""

[]

                       0                                                  1
0            ACTIVITY_ID                                              FLOAT
1             PROJECT_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
2             GRANTEE_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
3           IDIS_ACTV_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
4                   NAME  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
5       GRANTEE_ACTV_NUM  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
6               SETUP_DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
7        INIT_FUNDING_DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
8           COMPLETED_DT                                           DATETIME
9   ACTIVITY_STATUS_CODE  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
10        INSERT_USER_ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...

[]

                          0                                                  1
0                GRANTEE_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
1              IDIS_ACTV_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
2              ACTV_HOME_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
3               ACTIVITY_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
4          HOME_ACTV_CAT_ID  VARCHAR(25) COLLATE "SQL_Latin1_General_CP1_CI...
5                   CR_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
6              CHDO_TYPE_ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
7               GO_FWD_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
8          FAITH_BASED_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
9   SETUP_HOME_ACTV_TYPE_ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
10       MULTI_ADDRESS_FLAG                                              FLOAT
11      LOAN_GUARENTEE_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
12          TOTAL_EST_UNITS  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
13             HOME_REQ_AMT                                              FLOAT
14  COMPL_HOME_ACTV_TYPE_ID                                              FLOAT
15         PROPERTY_TYPE_ID                                              FLOAT
16        TOTAL_COMPL_UNITS                                              FLOAT
17         TOTAL_HOME_UNITS                                              FLOAT
18            AFFORD_PERIOD                                              FLOAT
19           MIXED_USE_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
20        MIXED_INCOME_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
21          READY_FUND_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
22      READY_COMPLETE_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
23          ACCOMPLISH_FLAG  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
24           INSERT_USER_ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
25         INSERT_TIMESTAMP  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
26      LAST_UPDATE_USER_ID                                           DATETIME
27    LAST_UPDATE_TIMESTAMP  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
28       COMPLETE_NARRATIVE                                           DATETIME

[]

                      0                                                  1
0                    ID                                            INTEGER
1           ACTIVITY ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
2            PROJECT ID                                              FLOAT
3            GRANTEE ID                                              FLOAT
4           ACTIVITY_no                                            INTEGER
5                  NAME  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
6         GRANTEE ACT #  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
7              SETUP DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
8       INIT FUNDING DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
9           COMPLETE DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
10           STATUSCODE  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
11              USER ID  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
12            INSERT DT                                           DATETIME
13          LAST UPDATE  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
14                LU DT  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
15  ACT ACCESS  GRANTEE                                              FLOAT
16              Field16  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...
17           ENV ASSESS  NVARCHAR(255) COLLATE "SQL_Latin1_General_CP1_...

[]

      0                                                  1
0  hims  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
1   APN  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...

[]

                         0                                                  1
0                     HIMS  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
1             Project Name  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
2                  Address  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
3             Program Type  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
4              Total Units  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
5         Restricted Units  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
6         Term of Covenant  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
7  Fee Per Restricted unit  NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...
8                     Fee   NVARCHAR(512) COLLATE "SQL_Latin1_General_CP1_...

[]

,0,1
0,LoanID,INTEGER
1,LtsProjectID,"VARCHAR(6) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
2,ProjUniqueID,INTEGER
3,ProjSeqLoanNo,SMALLINT
4,LoanYear,SMALLINT
5,ContractNo,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
6,LutLoanTypeCd,INTEGER
7,LutLoanStatusCd,SMALLINT
8,LutLoanStatusNewCd,SMALLINT
9,LutDaysInYrCd,INTEGER
10,LoanServOrgID,INTEGER
11,LutIntRatePeriodCd,"CHAR(1) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
12,LutAccrualMethodCd,"CHAR(1) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
13,LtsLoanNo,"VARCHAR(13) COLLATE ""SQL_Latin1_General_CP1_CI..."
14,DateServOrg,SMALLDATETIME
15,DateLoan,DATETIME
16,LoanPNote,MONEY
17,FlgStmt,BIT
18,AmtRegPmt,MONEY
19,AmtExpectAdj,MONEY
20,CurIntRatePct,"NUMERIC(5, 3)"
21,CurEquitySharePct,"NUMERIC(5, 3)"
22,CurResidualReceiptPct,"NUMERIC(6, 3)"
23,CurPrinBal,MONEY
24,CurIntBal,MONEY
25,CurFeeBal,MONEY
26,DateBalLastCalc,DATETIME
27,DateFirstIntAccrual,DATETIME
28,DateFirstPmtDue,DATETIME
29,DateBalloonPmt,DATETIME
30,DateMaturity,DATETIME
31,DateReview,DATETIME
32,DateEffChg,SMALLDATETIME
33,TermMonths,SMALLINT
34,AmortTermMonths,SMALLINT
35,BorrowerNamesForDoc,"VARCHAR(2000) COLLATE ""SQL_Latin1_General_CP1_..."
36,VestingLanguage,"VARCHAR(4000) COLLATE ""SQL_Latin1_General_CP1_..."
37,DateCreated,DATETIME
38,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
39,DateModified,DATETIME
40,ModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
41,Timestmp,TIMESTAMP
42,CBTSData,XML
43,LutLienID,INTEGER
44,FlgDelinquentLetter,BIT
45,FlgPostBorrowerCheck,BIT
46,LutLoanSubTypeCd,INTEGER
47,PmtDueDay,INTEGER
48,CurLatePaymentRatePct,"NUMERIC(5, 3)"
49,ReviewPeriodDays,TINYINT
50,LutLoanFundingLanguageCD,INTEGER
51,LoanServicerNumber,"VARCHAR(20) COLLATE ""SQL_Latin1_General_CP1_CI..."
52,AmtRegPmtAnnually,MONEY
53,FlgStmtAnnually,BIT
54,PropertyOnLoanDoc,"NVARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
55,CommentOnLoanDoc,"NVARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""

['fkLoan_LoanServOrg',
 'fkLoan_LutAccrualMethod',
 'fkLoan_LutDaysInYr',
 'fkLoan_LutIntRatePeriod',
 'fkLoan_LutLien',
 'fkLoan_LutLoanStatus',
 'fkLoan_LutLoanStatusNew',
 'fkLoan_LutLoanType',
 'fkLoan_Project']

                    0                                                  1
0        ProjUniqueID                                            INTEGER
1  LutMilestoneNameCD                                            INTEGER
2       DateRequested                                           DATETIME
3        DateReceived                                           DATETIME
4            Comments  VARCHAR(300) COLLATE "SQL_Latin1_General_CP1_C...
5           CreatedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
6         DateCreated                                           DATETIME
7            Timestmp                                          TIMESTAMP

['FK_MilestoneDate_LutMilestoneName', 'FK_MilestoneDate_Project']

                 0                                                  1
0     NSPFundUseID                                            INTEGER
1     ProjUniqueID                                            INTEGER
2  LutNSPFundUseCD                                            INTEGER
3   AmountReceived                                              MONEY
4          Comment  VARCHAR(1000) COLLATE "SQL_Latin1_General_CP1_...
5        CreatedOn                                           DATETIME
6        CreatedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
7       ModifiedOn                                           DATETIME
8       ModifiedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
9         Timestmp                                          TIMESTAMP

['FK_NSPFundUse_LutNSPFundUse', 'FK_NSPFundUse_Project']

,0,1
0,ProjUniqueID,INTEGER
1,ParticipantID,INTEGER
2,LutApplicantBorrowerID,INTEGER
3,LutParticipantIdentifyID,INTEGER
4,LutParticipantRoleID,INTEGER
5,LutSubParticipantIdentifyCD,INTEGER
6,PPriPhoneID,INTEGER
7,PSecPhoneID,INTEGER
8,PFaxPhoneID,INTEGER
9,PPersonID,INTEGER
10,PAddressID,INTEGER
11,PLegalStatusID,INTEGER
12,ParticipantType,INTEGER
13,PName,"VARCHAR(250) COLLATE ""SQL_Latin1_General_CP1_C..."
14,PEmail,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
15,PSSN,"VARCHAR(255) COLLATE ""SQL_Latin1_General_CP1_C..."
16,FedTaxID,"VARCHAR(255) COLLATE ""SQL_Latin1_General_CP1_C..."
17,CityLicense,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
18,CHDONum,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
19,WebSite,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
20,CHDOType,BIT
21,FaithBasedOrganization,BIT
22,LtsBorrowerID,"VARCHAR(11) COLLATE ""SQL_Latin1_General_CP1_CI..."
23,CBTSData,XML
24,EscrowOrOrderNo,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
25,ID,"VARCHAR(255) COLLATE ""SQL_Latin1_General_CP1_C..."
26,ParticipantIdentifyOther,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
27,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
28,DateCreated,DATETIME
29,DeletedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
30,DateDeletedOn,DATETIME
31,DateStart,DATETIME
32,DateEnd,DATETIME
33,Remark,XML
34,CareOf,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."

[]

                          0                                                  1
0     AssnProjectPropertyID                                            INTEGER
1              PercentageID                                            INTEGER
2              LutBDRTypeCD                                            INTEGER
3                  AMIValue                                            INTEGER
4            GrossRentValue                                              MONEY
5                     Other                                              FLOAT
6                 CreatedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
7                ModifiedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
8               DateCreated                                           DATETIME
9              DateModified                                           DATETIME
10     LutStatisticalTypeID                                            INTEGER
11               amtUtility                                              MONEY
12  PercentGrossRentUnitsID                                            INTEGER

['FK_LutStatisticalTypeID_LutStatisticalType',
 'FK_PercentageID_LutStatisticalType',
 'FK_PercentGrossRentUnits_AssnProjectProperty',
 'FK_PercentGrossRentUnits_LutBDRType']

                        0                                                  1
0            ProjUniqueID                                            INTEGER
1  LutProgramMilestonesCD                                            INTEGER
2               StartDate                                           DATETIME
3              FinishDate                                           DATETIME
4               CreatedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
5           DateCreatedBy                                           DATETIME
6              ModifiedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
7            DateModified                                           DATETIME

['FK_ProgramMilestones_LutProgramMilestones', 'FK_ProgramMilestones_Project']

,0,1
0,ProjUniqueID,INTEGER
1,ProjectNo,INTEGER
2,ProjParentUID,INTEGER
3,LutProjectStatusCd,INTEGER
4,ProjName,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
5,CalendarYear,INTEGER
6,CalendarMonth,INTEGER
7,LutNofaTypeID,INTEGER
8,NofaYear,INTEGER
9,LutNofaRoundID,INTEGER
10,FullProjectNumber,"VARCHAR(9) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
11,LutProjectCategoryID,INTEGER
12,LutProjectSubCategoryID,INTEGER
13,NumofUnits,SMALLINT
14,AttorneyphoneID,INTEGER
15,Attorneyname,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
16,LutDivisionDirectornameID,INTEGER
17,LutProgramManagernameID,INTEGER
18,LutProgramSupervisorID,INTEGER
19,LutFinanceOfficernameID,INTEGER
20,LutConstructionSpecialistID,INTEGER
21,LutContractAgencyID,INTEGER
22,LutContractAgencyManagerCD,INTEGER
23,LutContractAgencyContactCD,INTEGER
24,PropertyComments,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
25,DateCreatedOn,DATETIME
26,CreatedBy,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
27,DateModifiedOn,DATETIME
28,ModifiedBy,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
29,DateApplicationReceivedByLAHD,DATETIME
...,...,...
43,LutProjectSubStatusCD,INTEGER
44,LutCDBGNationalObjectiveCD,INTEGER
45,LutProjectStageCD,INTEGER
46,NumberOfJobCreated,INTEGER
47,CrossReferenceProjNo,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
48,LutProjectUnitStageCD,INTEGER
49,NotInWatchList,BIT
50,UnitsComment,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
51,IsUnitFixed,BIT
52,IsUnitFloating,BIT
53,IsIncludHOPWA,BIT
54,EstimatedNoOfUnitsForProjBasedRentalSubsidy,INTEGER
55,AmtEstimatedProjBasedRentalSubsidy,MONEY
56,NotInAffordableHousingRoster,BIT
57,IsAddedToWatchList,BIT
58,ProjectNo_String,"CHAR(6) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
59,LutProjectStatusStageCD,INTEGER
60,HODevProjName,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
61,LutMCCCreditAmtPercentCD,INTEGER
62,LutFundingLanguageCD,INTEGER
63,VestingLanguage,"VARCHAR COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
64,LutLienID,INTEGER
65,AmtSeniorLienDownPayment,MONEY
66,AmtClosingCost,MONEY
67,AmtPurchaseAssistance,MONEY
68,LutLocationTypeCD,INTEGER
69,LutPreservationStatusCD,INTEGER
70,LutRecapitalizationCD,INTEGER
71,PepDate,"VARCHAR(4) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
72,PepMonth,INTEGER

['FK_project_LutCDBGNationalObjective',
 'FK_project_LutConstructionSpecialist',
 'FK_Project_LutContractAgency',
 'FK_Project_LutContractAgencyContact',
 'FK_Project_LutContractAgencyManager',
 'FK_Project_LutCSP',
 'FK_project_LutDivisionDirectorname',
 'FK_project_LutFinanceOfficername',
 'FK_Project_LutFundingLanguage',
 'FK_Project_LutIDISActivityStatus',
 'FK_Project_LutLien',
 'FK_Project_LutLocationType',
 'FK_Project_LutMCCCreditAmtPercent',
 'FK_Project_LutNOFARound',
 'FK_Project_LutNOFAType',
 'FK_Project_LutPreservationStatus',
 'FK_project_LutProgramManagername',
 'FK_project_LutProgramSupervisor',
 'FK_Project_LutProjectCategory',
 'fk_Project_LutProjectStage',
 'FK_project_LutProjectStatus',
 'FK_Project_LutProjectStatusStage',
 'FK_Project_LutProjectSubCategory',
 'FK_project_LutProjectSubStatus',
 'FK_Project_LutProjectUnitStage',
 'FK_Project_LutRecapitalization']

                   0                                                  1
0                 ID                                            INTEGER
1       ProjUniqueID                                            INTEGER
2  CouncilFileNumber  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...
3        DateCreated                                           DATETIME
4          CreatedBy  VARCHAR(50) COLLATE "SQL_Latin1_General_CP1_CI...

['FK_ProjectCouncilFile_Project']

                    0                                                  1
0        Projuniqueid                                            INTEGER
1           DateStart                                           DATETIME
2             DateEnd                                           DATETIME
3  LutProjectStatusCD                                            INTEGER
4   Fullprojectnumber  VARCHAR(9) COLLATE "SQL_Latin1_General_CP1_CI_AS"

['fk_ProjectStatusChangeHistory_LutProjectStatus',
 'fk_ProjectStatusChangeHistory_Project']

                       0                                                  1
0   LutStatisticalTypeID                                            INTEGER
1           LutBDRTypeCD                                            INTEGER
2                  Value                                            INTEGER
3  AssnProjectPropertyID                                            INTEGER
4              CreatedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
5             ModifiedBy  VARCHAR(100) COLLATE "SQL_Latin1_General_CP1_C...
6            DateCreated                                           DATETIME
7           DateModified                                           DATETIME

[]

,0,1
0,PropertyID,INTEGER
1,HSE_ID,INTEGER
2,APNID,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
3,HouseNum,"VARCHAR(20) COLLATE ""SQL_Latin1_General_CP1_CI..."
4,HouseFracNum,"VARCHAR(5) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
5,PIN,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
6,CouncilDist,INTEGER
7,LutPropertyTypeID,INTEGER
8,Other,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
9,PreDirCd,"VARCHAR(2) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
10,StreetName,"VARCHAR(40) COLLATE ""SQL_Latin1_General_CP1_CI..."
11,StreetTypeCd,"VARCHAR(4) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
12,PostDirCd,"VARCHAR(5) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
13,UnitRange,"VARCHAR(7) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
14,ZipCode,INTEGER
15,CensusTract,"VARCHAR(8) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
16,CRANRA,"VARCHAR(5) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
17,StateAssemblyDist,INTEGER
18,StateSenDist,INTEGER
19,UsCongDist,INTEGER
20,LutPropertyModifiedReasonCD,INTEGER
21,DateCreated,DATETIME
22,CreatedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
23,DateModifiedOn,DATETIME
24,ModifiedBy,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
25,Unit,"VARCHAR(10) COLLATE ""SQL_Latin1_General_CP1_CI..."
26,IsUpdated,BIT
27,LutNSPRNLAProgramCD,INTEGER
28,RNLAType,"VARCHAR(10) COLLATE ""SQL_Latin1_General_CP1_CI..."
29,DecisiontoPurchase,BIT
30,DateDecisiontoPurchase,DATETIME
31,City,"VARCHAR(40) COLLATE ""SQL_Latin1_General_CP1_CI..."
32,LutCommunityPlanAreaCD,INTEGER
33,LutCertifiedNeiborhoodCouncilCD,INTEGER
34,LutSupervisorialDistrictCD,INTEGER
35,FullStreetName,"VARCHAR(100) COLLATE ""SQL_Latin1_General_CP1_C..."
36,FullCityName,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
37,address,"VARCHAR(179) COLLATE ""SQL_Latin1_General_CP1_C..."
38,LAHD_Count,INTEGER
39,LUPAM_Count,INTEGER
40,addressNoCSZ,"VARCHAR(103) COLLATE ""SQL_Latin1_General_CP1_C..."
41,OMDBSiteID,INTEGER
42,IsNSP1Eligible,BIT
43,IsNSP2Eligible,BIT
44,IsNSP3Eligible,BIT
45,IsObsolete,BIT
46,NSPEligible,"VARCHAR(9) COLLATE ""SQL_Latin1_General_CP1_CI_AS"""
47,Latitude,"DECIMAL(15, 5)"
48,Longitude,"DECIMAL(15, 5)"
49,ZoneCd,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
50,LandUseCd,"VARCHAR(50) COLLATE ""SQL_Latin1_General_CP1_CI..."
51,ImprovBltYr,INTEGER
52,ImprovSqftAmt,MONEY
53,PrclAcreageAmt,MONEY
54,IsInFloodZone,"VARCHAR(20) COLLATE ""SQL_Latin1_General_CP1_CI..."
55,IsRSO,BIT
56,CensusTract2010,INTEGER
57,addressCSZ,"VARCHAR(75) COLLATE ""SQL_Latin1_General_CP1_CI..."

['FK_property_LutNSPRNLAProgram',
 'FK_Property_LutPropertyModifiedReason',
 'FK_Property_LutPropertyType']

In [53]:
# List all the tables in lut_tables with separation (**need to add table headers**)
'''import pandas as pd
from sqlalchemy.engine import reflection
from eralchemy import render_er
insp1 = reflection.Inspector.from_engine(engine)
for tbl in lut_tables: 
    erdl = [(c['name'], c['type']) for c in insp1.get_columns(tbl)]
    erdl_df = pd.DataFrame(erdl)    
    display(erdl_df)'''

"import pandas as pd\nfrom sqlalchemy.engine import reflection\nfrom eralchemy import render_er\ninsp1 = reflection.Inspector.from_engine(engine)\nfor tbl in lut_tables: \n    erdl = [(c['name'], c['type']) for c in insp1.get_columns(tbl)]\n    erdl_df = pd.DataFrame(erdl)    \n    display(erdl_df)"

In [54]:
# return a valid list of attributes of the object 
print(dir(engine))

['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_connection_cls', '_contextual_connect', '_echo', '_execute_clauseelement', '_execute_compiled', '_execute_default', '_execution_options', '_has_events', '_optional_conn_ctx_manager', '_run_visitor', '_should_log_debug', '_should_log_info', '_trans_ctx', '_wrap_pool_connect', 'begin', 'connect', 'contextual_connect', 'create', 'dialect', 'dispatch', 'dispose', 'driver', 'drop', 'echo', 'engine', 'execute', 'execution_options', 'get_execution_options', 'has_table', 'logger', 'logging_name', 'name', 'pool', 'raw_connection', 'run_callable', 'scalar', 'schema_for_object', 'table_names', 'transaction', 'update_execution_options', 'url']

In [55]:

from sqlalchemy import MetaData
from sqlalchemy_schemadisplay import create_schema_graph

# create the pydot graph object by autoloading all tables via a bound metadata object
graph = create_schema_graph(metadata=MetaData(bind=engine),
   show_datatypes=True, # The image would get nasty big if we'd show the datatypes
   show_indexes=True, # ditto for indexes
   rankdir='LR', # From left to right (instead of top to bottom)
   concentrate=False # Don't try to join the relation lines together
)
graph.write_png('tbl_schema.png') # write out the file

ProgrammingError: (pyodbc.ProgrammingError) ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Incorrect syntax near 'HIMS'. (102) (SQLExecDirectW)")
[SQL: sp_columns @table_name = ''HIMS CCRIS KORY 82710$'', @table_owner = 'dbo']
(Background on this error at: http://sqlalche.me/e/f405)

In [60]:
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
import pandas as pd
from eralchemy import render_er

from sqlalchemy import (MetaData, Table, Column)    
metadata = MetaData(bind=engine)
render_er(metadata, 'erd.svg')

In [ ]:
filename = 'erd.png'
render_er(metadata, filename)
imgplot = plt.imshow(mpimg.imread(filename))
plt.rcParams["figure.figsize"] = (15,10)
plt.show()

In [ ]:
## Draw from database
render_er("sqlite:///relative/path/to/db.db", 'erd_from_sqlite.png')

In [ ]:
'''# Show ER model from here
filename = 'mymodel.png'
render_er(metadata, filename)
imgplot = plt.imshow(mpimg.imread(filename))
plt.rcParams["figure.figsize"] = (15,10)
plt.show()'''

In [61]:
filtered = list(filter(lambda x: x.find("Lut") != 0 and x.lower().find("temp") != 0, engine.table_names()))

In [62]:
filtered

['A',
 'ActivityLog',
 'ADAStatistics',
 'ADAUnits',
 'Address',
 'AddressHistory',
 'Amendment',
 'AmerinationalBalance',
 'AmerinationalBalance083011',
 'AmeriNationalImportHistory',
 'AMI2008',
 'AMI2009',
 'AMI2010',
 'ApnFromSusam',
 'ApprovalMilestones',
 'AssnDivisionStaff',
 'AssnLoanBankruptcy',
 'AssnLoanBorrower',
 'AssnLoanForeclosures',
 'AssnLoanLoanRollOver',
 'AssnLoanProbate',
 'AssnLoanProjectArea',
 'AssnLoanProjectss',
 'AssnLoanProperty',
 'AssnLoanPropertyDuplicate',
 'AssnLoanShortPay',
 'AssnLoanStaff',
 'AssnLoanStatementHardCopy',
 'AssnLoanVOM',
 'AssnLoanWriteOff',
 'AssnMilestoneNameFieldToValidate',
 'AssnProjAPNCCRIS',
 'AssnProjAPNCCRISHistory',
 'AssnProjectAPNCBTS',
 'AssnProjectFundProjectArea',
 'AssnProjectIDIS',
 'AssnProjectIDISNo',
 'AssnProjectParticipant',
 'AssnProjectParticipantCareOf',
 'AssnProjectProperty',
 'AssnProjectUnits',
 'AssnProjectUseProjectArea',
 'AssnProjectWorkorder',
 'AssnREOLoan',
 'AssnREOProject',
 'AssnREOProperty',
 'Assumption',
 'Bankruptcy',
 'BasicPropertyInfo',
 'Bond',
 'BondApp',
 'BUCDLACExpireDate',
 'CBTSProjStat',
 'CBTSSubProj',
 'CBTSUser',
 'CCRIS',
 'ccris_1117',
 'CCRIS_140',
 'CCRIS_IDIS',
 'ccris1',
 'ccris1207',
 'cdd',
 'Cleaned MANAGMENT COMPNAY INFO WORKSHEET 01092014',
 'Confirmation',
 'Construction',
 'ConstructionChangeOrder',
 'ConstructionFinancing',
 'ConstructionInspection',
 'ContactPerson',
 'ContactPersonDuplicate',
 'CostAllocation',
 'CouncilProject',
 'CRAScanFilesHistory',
 'CreditMemo',
 'DataCleanUp',
 'DataCleanUpLoanProp',
 'DataCleanUpRawAPNs',
 'DataCleanUpRawIDISs',
 'Demand',
 'DemandFeeDefault',
 'DemandHardCopy',
 'DemandNote',
 'DemandPriorDates',
 'DevelopmentCostSummary',
 'docinfosave011211',
 'DocumentAttachment',
 'DocumentAttachment1119',
 'DocumentsInfo',
 'EllisApns',
 'EllisApnsOnly',
 'ExecutionLock',
 'FieldToValidate',
 'FMSDownload2015',
 'FMSTemp',
 'Foreclosures',
 'FundingInfo',
 'FundingInfoCRAAdditionalData',
 'FundingInfoDuplicate',
 'FundingInfoForAct12',
 'FundingInfoHistory',
 'FundingInfoMap',
 'FundingInfox',
 'FundTransfer',
 'gis',
 'gis_1',
 'h',
 'HHH_BUDGET',
 'HHH_Budget_Acct',
 'HHHDatesImport',
 'HHHMilestone',
 "'HIMS CCRIS KORY 82710$'",
 'HIMSSCHEP',
 'HistoryChanges',
 'HistoryChangesDetail',
 'HistoryEmail',
 'HistoryLoan',
 'HistoryLoanPrinBalDaily',
 'HistoryLoanServOrg',
 'HistoryLoanTemp',
 'HistoryProjectStage',
 'HistoryScorecardREO',
 'HistoryVOM',
 'Holidays',
 'Home1',
 'HouseholdCharacteristics',
 'HouseHoldMembers',
 'IDISActivity',
 'IDISHomeCount',
 'IDISHomeCount2',
 'IDISHomeStatus',
 'InterimFinancing',
 'land use fees_1',
 'land use fees_2',
 'land use fees_3',
 'landuseAPN_1',
 'landuseAPN_2',
 'landuseAPN_a',
 'landuseAPN_b',
 'LandUsed',
 'LandUsed_1',
 'LandUsed_2',
 'LandUseProject',
 'LeadBidder',
 'LeadBlood',
 'LeadConstruction',
 'LeadDraw',
 'LeadGrantSummary',
 'Ledger',
 'LedgerComment',
 'LedgerFund',
 'LedgerFundTemp',
 'LedgerNSPCode',
 'LicenseInfo',
 'LicenseInfoHistory',
 'Loan',
 'LoanBalance',
 'LoanBalanceAuditLog',
 'LoanComment',
 'LoanDisb',
 'LoanDocsGenerated',
 'LoanDocumentsObsolete',
 'LoanFee',
 'LoanFeeTemp',
 'LoanFund',
 'LoanFundDisb',
 'LoanFundPaid',
 'LoanPmt',
 'LoanPmtBatch',
 'LoanPmtBatchDetails',
 'LoanPmtTemp',
 'LoanRelated',
 'LoanRollOver',
 'LoanServOrg',
 'LoanStaff',
 'LoanTemp',
 'LoanWatchList',
 'LOOtherValue',
 'LSExceptionHistory',
 'LtsTempNoCalc',
 'LtsTempUndisbAmt',
 'MFT',
 'MilestoneDate',
 'MilestoneDateHistory',
 'MissingTargetPopulation',
 'MissingTargetPopulationContacts',
 'MissingTargetPopulationLog',
 'MissingTargetPopulationUsers',
 'Monthes',
 'NSP',
 'NSPBuyerFundSource',
 'NSPCompany',
 'NSPFinancialInfo',
 'NSPFLender',
 'NSPFundUse',
 'NSPGeneric',
 'NSPInspectionWF',
 'NSPInspectionWFItem',
 'NSPInspectionWFRemarks',
 'NSPLutSpecDescription',
 'NSPProperty',
 'NSPPropertyPhase',
 'NSPPropertyPhaseHistory',
 'Old_ProjectConstructionInspection',
 'OMAPNInfo',
 'OMCovenant',
 'OMCovenant_37+',
 'OMCovenantHistory',
 'OMCovStatusHistory',
 'OMProjXHimsProj',
 'OMReportingComplianceStatus',
 'OneTableTime',
 'Participant',
 'ParticipantHistory',
 'ParticipantNotInProjectAndLoan',
 'ParticipantsIsolation',
 'ParticipantTest',
 'PercentGrossRentUnits',
 'PercentGrossRentUnits_LandUsed37+',
 'PermanentFinancing',
 'Person',
 'PersonHistory',
 'Phone',
 'PhoneHistory',
 'PMCMigration',
 'PMCMigrationImport',
 'PMCTemp',
 'PMCTemp_02212014',
 'PR02',
 'Probate',
 'ProgramMilestones',
 'ProgramMilestonesCopy',
 'ProjConsContractInfo',
 'ProjConsContractInfoHistory',
 'ProjDataCleanUpHist',
 'Project',
 'project11182011',
 'ProjectCharOne',
 'ProjectCharTwoMore',
 'ProjectCouncilFile',
 'ProjectsCrossreference',
 'ProjectStatusChangedHistory',
 'ProjectStatusChangeHistory',
 'ProjectUnits',
 'Property',
 'Property0728',
 'Property1021',
 'PropertyAdditionalInfo',
 'PropertyHistory',
 'PropertyModifyHistory_10252012',
 'QBPaymentMapping',
 'Reconveyances',
 'ReconveyancesHistory',
 'REO',
 'REOInsurance',
 'RptBorrowerAddress',
 'SalesPrice',
 'ScoreCard',
 'ScoreCard_1',
 'ScoreCard_Bond',
 'Sheet1$',
 'ShortPay',
 'SingleHouseMilestones',
 'Split',
 'SSRS_Participant',
 'StatementHardCopy',
 'Subordination',
 'SubordinationAllLoans',
 'Subsidy',
 'sysdiagrams',
 'SystemExceptionLogs',
 'T1',
 'TargetPopulation',
 'tbl',
 'TestBackCheck',
 'TestLoanPmt',
 'TruncatedHomeInventory',
 'UnitDescription',
 'UpDocumentsObsolete',
 'UseofFunds',
 'uspGetOMExportParams',
 'VerificationOfMortgage',
 'WorkOrderPerProjectandLoan',
 'WriteOff',
 'ZZHaclaSPCProject',
 'zzztmp_ProjWorkOrders_PaysrLaborDetails']

In [65]:
def printSchema(filtered):
    for tbl in connection.execute(
        """
        select NAME from table where TYPE='table' order by NAME;
        """
    ):
        print("{}:".format(table))
        for (
            columnID, columnName, columnType,
            columnNotNull, columnDefault, columnPK,
        ) in connection.execute("pragma table_info('{}');".format(table)):
            print("  {id}: {name}({type}){null}{default}{pk}".format(
                id=columnID,
                name=columnName,
                type=columnType,
                null=" not null" if columnNotNull else "",
                default=" [{}]".format(columnDefault) if columnDefault else "",
                pk=" *{}".format(columnPK) if columnPK else "",
            ))
print(printSchema(filtered))

AttributeError: 'list' object has no attribute 'execute'

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
db = sqlite3.connect('engine')
table = pd.read_sql_query("SELECT * from table_list", db)
table.to_csv(table_name + '.csv', index_label='index')

In [ ]:
'''from eralchemy import render_er
from sqlalchemy.engine import reflection
insp = reflection.Inspector.from_engine(engine)

#def tbl_erd(table):
for tbl in table_list:
    for c in insp.get_columns(tbl): 
        print(c['name'], c['type']
        groupby('table')
        #erd_info = [(c['name'], c['type']) for c in insp.get_columns(tbl)]
            #name = table_list,
            #columns = [c['type'] for c in insp.get_columns(tbl)]
    #render_er(erd_info, 'erd.png')
        '''

In [ ]:
'''#!python
#from myapp import model
from sqlalchemy_schemadisplay import create_uml_graph
from sqlalchemy.orm import class_mapper

# lets find all the mappers in our model
mappers = []
for attr in dir(erd):
    if attr[0] == '_': continue
    try:
        cls = getattr(erd, attr)
        mappers.append(class_mapper(cls))
    except:
        pass

# pass them to the function and set some formatting options
graph = create_uml_graph(mappers,
    show_operations=False, # not necessary in this case
    show_multiplicity_one=False # some people like to see the ones, some don't
)
graph.write_png('schema.png') # write out the file'''